using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Windows.Forms;

namespace Fitness_M
{
    public partial class ReportContract : Form
    {
        int m_PageNum = 1;
        private Tickets m_Tickets;

        public static void ShowReport(Tickets tickets)
        {
            var frm = new ReportContract();
            frm.m_Tickets = tickets;
            frm.ShowDialog();
        }

        public ReportContract()
        {
            InitializeComponent();
        }

        private void OnPrintClick(object sender, EventArgs e)
        {
            printDoc.Print();
        }

        private void OnPrintPage(object sender, System.Drawing.Printing.PrintPageEventArgs e)
        {
            float fieldSize = 40;

            float textSizeHeader = 12;
            float textSize = 8;
            float space = 8;

            var fontHeader = new Font(FontFamily.GenericSansSerif, textSizeHeader,FontStyle.Bold);
            var fontFitness = new Font(FontFamily.GenericSansSerif, textSize, FontStyle.Bold);
            var fontTime = new Font(FontFamily.GenericSansSerif, textSize);

            var brush = Brushes.Black;


            string rslt = "";

            if (m_PageNum == 1)
            {
                rslt = string.Format(GetFirstPage(),
                    m_Tickets.ClientRef.Number, 
                    DateTime.Now.ToString("dd.MM.yyyy"),
                    m_Tickets.ClientRef.SurName + " "+m_Tickets.ClientRef.Name + " "+m_Tickets.ClientRef.LastName,
                    m_Tickets.KindTicketsRef.Period,
                    m_Tickets.KindTicketsRef.CountBalls,
                    m_Tickets.KindTicketsRef.Price);
            }
            else
            {
                rslt = string.Format(GetSecondPage(),
                    m_Tickets.ClientRef.SurName + " " + m_Tickets.ClientRef.Name + " " + m_Tickets.ClientRef.LastName,
                    m_Tickets.ClientRef.DateBirth.ToString("dd.MM.yyyy"),
                    m_Tickets.ClientRef.Address,
                    m_Tickets.ClientRef.Phone);
            }

            e.Graphics.DrawString(rslt, fontTime, brush, fieldSize, space);

            if (m_PageNum == 1)
            {
                m_PageNum++;
                e.HasMorePages = true;
            }
            else
            {
                e.Graphics.DrawString(@"
Клиент:

Ознакомлен и согласен с содержанием настоящего  
Договора и всех его приложений, в том числе
Противопоказаниями по здоровью
и с Правилами Клуба.
___________________/ _________________

Согласен на получение sms и e-mail рассылок
___________________/ _________________ /

Договор на руки получил
___________________/_________________ / 
", fontTime, brush, 400, 540);
            }
        }

        public string GetSecondPage()
        {
            return @"
      4.3. Если Клиент настаивает на расторжении настоящего договора и возврате денежных средств при соблюдении 
п.2.3. настоящего Договора, Правил Клуба,  то сумма возврата будет составлять стоимость абонемента за вычетом 
фактически понесенных Исполнителем расходов, связанных с исполнением обязательств по настоящему договору. 
Расчет фактически понесенных расходов Клуба составляет количество потраченных 
Членом клуба единиц, умноженное на стоимость одной единицы в следующем размере:
- 232,5 рубля если потрачено менее 40 единиц,
- 107,25 рубля если потрачено от 41 до 120 единиц,
- 59,25 рубль если потрачено более 121 единицы.
      4.4. Возврат денежных средств производится в установленном порядке, а именно: Клиент подает заявление на имя 
Исполнителя - ИП Подоля Екатерина Витальевна с указанием причин возврата, прикладывает абонемент, 
Исполнитель рассматривает заявление в течение десяти дней. 
      
                                                                V.Персональные данные
      5.1. Клиент настоящим положением подтверждает свое согласие на обработку своих персональных данных и  
биометрических персональных данных с использованием средств автоматизации или без использования таких средств, 
для целей ведения учета посещения занятий, а также учета времени прихода и ухода и контроля физического доступа на территорию клуба  с 
использованием сканера отпечатков пальцев и (или) биометрического терминала учета времени и контроля доступа. Данное согласие дается 
на срок действия настоящего Договора.       

                                                                VI. Заключительные положения
      6.1. Все споры и разногласия, связанные с заключением, исполнением и прекращением настоящего Договора Стороны будут стремиться 
разрешать путем переговоров.
      6.2. Настоящий Договор составлен в двух экземплярах, имеющих одинаковую юридическую силу, по одному для каждой из Сторон.
                                                                VII. Срок действия
7.1. Настоящий Договор заключен на период действия абонемента, указанного в п.1.2 настоящего Договора. 

                                                                VIII.Реквизиты и подписи сторон
Исполнитель:  ИП Подоля Екатерина Витальевна, 
г. Краснодар, Западный район, 
ул. Индустриальная, 16 кв. 7


Клиент:  {0}

Паспорт______________________________________________       Дата рождения {1}

Адрес {2}

Телефон {3}       E-mail  ________________

                                                                IX.Подписи сторон


Исполнитель:

ИП Подоля Екатерина Витальевна, 
действующая на основании свидетельства 
о государственной регистрации 
физического лица в качестве индивидуального 
предпринимателя N314230903000032

_________________ Е.В. Подоля


Договор оформил _______________________
";
        }

        public string GetFirstPage()
        {
            return @"

                                                            ДОГОВОР на оказание услуг
                                                            ЧЛЕНСКАЯ КАРТА № {0}

г. Краснодар                                                                                                                                                                      {1}                                        

          ИП Подоля Екатерина Витальевна, действующая на основании свидетельства о государственной регистрации 
физического лица в качестве индивидуального предпринимателя N314230903000032,
зарегистрирована: г. Краснодар, Западный район, ул. Индустриальная, 16 кв. 7 
именуемое в дальнейшем Исполнитель с одной стороны, 
и {2}, именуемая в дальнейшем Клиент, с другой стороны,
заключили настоящий Договор о нижеследующем:

                                                                I. Предмет договора и порядок расчетов
      1.1. Исполнитель оказывает услуги Клиенту согласно приобретенному абонементу на занятия 
в спортивно-оздоровительном клубе сети ТОНУС-КЛУБ® (в дальнейшем Клуб), расположенном по адресу: 
г. Краснодар, ул. Яна Полуяна, д.43. 
      1.2. Абонемент (период действия): месяцев {3} ,    количество единиц {4} , время (льготное или основное),  
скидка ____%,    стоимость {5}.
      1.3. Порядок расчета по настоящему договору: рассрочка _________, 
первоначальный взнос _____________ (__________________________________________________) рублей до __________________2013г.,
полная оплата __________ (_____________________________________ _________________________) рублей до __________________2013г.

     1.4. Право посещения Клуба (возможность первого посещения) возникает у Клиента после оплаты стоимости 
спортивно-оздоровительных услуг в соответствии п.1.3. настоящего Договора. 

                                                                II. Права и Обязанности сторон
      2.1. Исполнитель обязуется:
      2.1.1. После подписания настоящего Договора и оплаты услуг обеспечить Клиента местом для занятий, соответствующим оборудованием.
      2.1.2. Выдать  членскую карту с индивидуальным номером, настоящий Договор 
и абонемент с кассовым чеком/бланком строгой отчетности.
      2.1.3. Ознакомить Клиента с дополнительной информацией, касающейся комплекса спортивно-оздоровительных услуг 
и условиями их предоставления.
      2.2. Исполнитель имеет право:
      2.2.1. В одностороннем порядке изменять часы работы Клуба. Информация о предстоящих изменениях размещается 
на информационных досках рецепции.
      2.2.2. Клуб вправе в одностороннем порядке вносить изменения и дополнения в Прайс-лист, 
предварительно уведомив Клиента за один месяц. Под уведомлением в настоящем пункте подразумевается размещение информации 
о предстоящем изменении Прайс-листа на рецепции клуба. 
      2.2.3. Закрывать отдельные тренировочные зоны для проведения ремонтных, профилактических работ и 
в силу иных причин без предоставления Заказчику дополнительной компенсации.
      2.3. Клиент обязуется:
      2.3.1. Своевременно оплатить спортивно-оздоровительные услуги.
      2.3.2. Ознакомиться с противопоказаниями по здоровью к занятиям и не требовать возмещения ущерба здоровью, 
полученного в результате злоупотребления занятиями.
      2.3.3. Информировать Клуб о состоянии своего здоровья в случае, если это  может отразиться на жизни и здоровье как самого Клиента, 
так и представлять угрозу жизни или здоровью окружающих во время посещения Клуба.
      2.3.4. Ознакомиться с Правилами Клуба и Противопоказаниями по здоровью  до  первого посещения на рецепции Клуба.
      2.3.5. Соблюдать Правила Клуба  и следовать рекомендациям инструкторов (администраторов) Клуба.
      2.3.6. Соблюдать чистоту и порядок  во всех помещениях клуба.
      2.3.7. Бережно относиться к спортивному оборудованию (имуществу) Клуба.
      2.3.8. Не опаздывать к началу посещения, на которое была произведена предварительная запись. 
В случае задержки более чем на 10 (десять) минут Клиенту может быть отказано в занятии. В таком случае занятие пропадает.
      2.3.9. Зарегистрировать Гостей на номер своей Клубной карты, проинформировать Гостей о том, 
что на них распространяются  права и обязанности Клиента.  При этом Гость проходит процедуру регистрации 
на рецепции Клуба и предъявляет для этого документ, удостоверяющий личность (паспорт, военный билет или водительское удостоверение). 
При отсутствии указанных документов Гость в Клуб не допускается. 

      2.4. Клиент  имеет право:
      2.4.1. Отменить или перенести посещение, а именно посещение, на которое была произведена предварительная запись. 
Отмена или перенесение посещения осуществляется не менее чем за один час до намеченного времени посещения, 
в случае несоблюдения данного порядка уведомления услуга считается оказанной Клиенту.
      2.4.2. Привести в клуб Гостей (гостевой визит). 

                                                                III. Ответственность Сторон
      3.1. Клиент несет материальную ответственность за ущерб, причиненный имуществу Клуба. 
В случае причинения Клиентом ущерба имуществу Исполнителя, Клиент  обязан возместить Исполнителю стоимость 
поврежденного и/или утраченного имущества.
      3.2. Клиент несет солидарную ответственность за соблюдение приглашенными им Гостями Правил Клуба, 
а также за причиненный ими ущерб имуществу Исполнителя в размере суммы причиненного ущерба. 
В случае невозможности исполнения Гостем своей части обязательств по возмещению ущерба, причиненного имуществу Исполнителя, 
ответственность за причиненный ущерб несет Клиент  в полном объеме.
      3.3. В случае причинения Клиентом ущерба имуществу Исполнителя, 
Клиент в течение 5  (пяти) календарных дней обязан возместить причиненный ущерб в полном объеме. 
В противном случае, а также в случае невозмещения ущерба в соответствии с п. 3.3. настоящего Договора Исполнитель оставляет 
за собой право в одностороннем порядке расторгнуть настоящий Договор. В этом случае внесенные Клиентом по настоящему Договору 
денежные средства возврату не подлежат, а удерживаются Исполнителем в качестве компенсации за причиненный ущерб 
имуществу Исполнителя. 
      3.4. Исполнитель не несет ответственности:
За вред здоровью при нарушении Клиентом и/или приглашенным им Гостем Правил Клуба и рекомендаций администраторов 
(инструкторов) Клуба. 

                                                                IV. Досрочное расторжение договора
      4.1. В случае нарушения Клиентом и/или Гостем Клиента настоящего Договора, Правил Клуба Исполнитель имеет право 
расторгнуть Договор в одностороннем порядке. Право Клуба на расторжение Договора в одностороннем порядке возникает с момента 
обнаружения факта нарушения Клиентом и/или Гостем Клиента. В этом случае остаток денежных  средств за неиспользованное время 
комплекса спортивно-оздоровительных услуг не возвращается.
      4.2. При нарушении Клиентом сроков оплаты стоимости спортивно-оздоровительных услуг Исполнитель вправе в одностороннем порядке 
расторгнуть настоящий Договор.
";
        }

        private void btnNextPage_Click(object sender, EventArgs e)
        {
            if (printPreviewControl1.StartPage < m_PageNum)
                printPreviewControl1.StartPage += 1;
        }

        private void btnPrevPage_Click(object sender, EventArgs e)
        {
            if (printPreviewControl1.StartPage > 0)
                printPreviewControl1.StartPage -= 1;
        }
    }


}
